Repository: dnaber-de/WP-Colored-Coding
Catalog: lang/wp-cc-*.po
Languages: de_de, es_es, zh_cn

source: Code Blocks
de_de: Codeschnipsel
es_es: bloques de código
zh_cn: 代码

source: To delete a codeblock just leave the textarea(code) empty and update.
de_de: Um ein Codeschnipsel zu löschen, einfach ein leeres Eingabefeld (Code) absenen.
es_es: Para borrar un bloque de código solamente deja el área del texte (code) vacío y actualizar.
zh_cn: 想要删除一段代码，清空 textarea／code 区域并选择更新即可。

source: Give me the next block
de_de: Ein leeres Schnipsel, bitte.
es_es: Darme el próximo bloque
zh_cn: 下一段代码

source: Name
de_de: Bezeichner
es_es: nombre
zh_cn: 名称

source: Use within the Shortcode [cc name=""]
de_de: Wird im Shortcode verwendet [cc name=""]
es_es: Usar dentro del shortcode [cc name=""]
zh_cn: 在 [cc name=""] 中使用

source: Language
de_de: Sprache
es_es: idioma
zh_cn: 语言

source: Leave empty for no syntax highlighting
de_de: Leer lassen um kein Highlighting zu nutzen
es_es: dejar vacía para no syntax-highlighting
zh_cn: 留空则不高亮语法

source: Raw HTML Code (Note! This will print the plain Code without any escaping filters)
de_de: Ungefiltertes HTML (Achtung! Alles was drin steht, wird auch ausgeführt)
es_es: código HTML sin filtrar (¡Cuidado! Todo lo que está en el áreal de texte también se exportaron)
zh_cn: 原始 HTML 代码（注意：此项会直接输出原代码而不进行任何转义）

source: Insert Tab
de_de: Tab einfügen
es_es: pegar pestaña
zh_cn: 插入标签

source: Code
es_es: Código
zh_cn: 代码

source: Update
de_de: Aktualisieren
es_es: actualización
zh_cn: 更新

source: WP Colored Coding settings
de_de: WP Colored Coding Einstellungen
es_es: WP Colored Coding opciónes
zh_cn: WP Colored Coding 设置

source: Use syntax highlighting?
de_de: Syntax-highlighting verwenden?
es_es: Utilice sintaxis coloreada?
zh_cn: 开启语法高亮？

source: Syntax highlighting theme
de_de: Welches Theme?
es_es: Tema resaltado de sintaxis
zh_cn: 语法高亮主题

source: Enable the raw output option?
de_de: Option für ungefiltertes HTML aktivieren?
es_es: Activar opción para HTML sin filtrar?
zh_cn: 开启原代码输出选项

source: Provide an option on each codeblock to print it as raw HTML/Javascript instead of escaping it.
de_de: Ermöglicht für jedes Codeschnipsel, es als reines HTML (ohne Filter) auszugeben.
es_es: Permite a cada bloque de código emitirlo como una neta HTML (sin filtro).
zh_cn: 勾选此选项让 WordPress 在输出 HTML／Javascript 代码时不对代码部分进行任何转义。

source: If you want to use syntax highlighting via rainbow.js, just enable it and choose a theme.
de_de: Wenn Du Rainbow.js zur optischen Gestaltung (Syntax-Highlighting) nutzen willst, setze die Option und wähle ein Theme.
es_es: Si desea utilizar la sintaxis destacando via rainbow.js, solamente habilita y elige un tema.
zh_cn: 如果您想通过 rainbow.js 开启语法高亮，勾选此项即可。

source: Insert a Codeblock
de_de: Füge ein Codeschnipsel ein
es_es: Pegar un bloque de código
zh_cn: 插入一段代码

source: Available Codeblocks
de_de: Verfügbare Codeschnipsel
es_es: bloques de código disponible
zh_cn: 可用代码

source: or write your code into the editor
de_de: oder schreibe den Code direkt in den Editor
es_es: o escribe su código al editor
zh_cn: 或者手动在编辑器中添加

source: Languages supported by Rainbow.js
de_de: Unterstützte Sprachen
es_es: idiomas apoyadas por rainbow.js
zh_cn: Rainbow.js 支持的语言

source: Insert Shortcode
de_de: Shortcode einfügen
es_es: pegar shortcode
zh_cn: 插入代码
